IDEA StatiCa Open Model
MatSteelEc2.DiagramType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of material diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public SteelDiagramType DiagramType { get; set; }
Public Property DiagramType As SteelDiagramType
	Get
	Set
public:
property SteelDiagramType DiagramType {
	SteelDiagramType get ();
	void set (SteelDiagramType value);
}
Property Value
Type: SteelDiagramType
See Also
Reference
MatSteelEc2 Class
IdeaRS.OpenModel.Material Namespace